workloads/vllm/results/uvm_kv_bench_single_process.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7fa30afcc5e0>, seed=42, num_prompts=20, dataset_name='sharegpt', no_stream=False, dataset_path='/home/ubuntu/nvidia-uvm-gpu/workloads/vllm/datasets/ShareGPT_V3_unfiltered_cleaned_split.json', no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=512, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='Qwen/Qwen3-30B-A3B-FP8', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=5.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-ca6af557-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600, extra_body=None)
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:53 elapsed, 860:58:12 remaining
Initial test run completed.
Starting main benchmark run...
Traffic request rate: 5.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 20/20 [02:09<00:00,  6.48s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     20        
Failed requests:                         0         
Request rate configured (RPS):           5.00      
Benchmark duration (s):                  129.55    
Total input tokens:                      5761      
Total generated tokens:                  10240     
Request throughput (req/s):              0.15      
Output token throughput (tok/s):         79.04     
Peak output token throughput (tok/s):    160.00    
Peak concurrent requests:                20.00     
Total Token throughput (tok/s):          123.51    
---------------Time to First Token----------------
Mean TTFT (ms):                          14927.98  
Median TTFT (ms):                        3223.63   
P99 TTFT (ms):                           65045.83  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          124.06    
Median TPOT (ms):                        125.97    
P99 TPOT (ms):                           129.65    
---------------Inter-token Latency----------------
Mean ITL (ms):                           124.06    
Median ITL (ms):                         119.50    
P99 ITL (ms):                            154.77    
==================================================